OpenNuvoton/M253BSP/SampleCode/StdDriver/USBD_VCOM_MultiPort/descriptors.c
    /* Abstract Control Management Functional Descriptor  */
    0x04,                            /* Size of the descriptor, in bytes */
    DESC_CDC_CS_INTERFACE,           /* CS_INTERFACE descriptor type */
    DESC_CDC_ABSTRACT_CONTROL_MODEL, /* Abstract control management functional
                                        descriptor subtype */
    0x00,                            /* bmCapabilities       */

    /* Union Functional descriptor */
    0x05,                  /* bLength              */
    DESC_CDC_CS_INTERFACE, /* bDescriptorType: CS_INTERFACE descriptor type */
    DESC_CDC_UNION,        /* bDescriptorSubType   */
    INTF_NUM_VCOM3,        /* bMasterInterface     */
    INTF_NUM_VCOM3 + 1,    /* bSlaveInterface0     */

    /* ENDPOINT descriptor */
    LEN_ENDPOINT,                 /* bLength          */
    DESC_ENDPOINT,                /* bDescriptorType  */
    (EP_INPUT | INT_IN_EP_NUM_3), /* bEndpointAddress */
    EP_INT,                       /* bmAttributes     */
    GET_BYTE0(EP11_MAX_PKT_SIZE),
    GET_BYTE1(EP11_MAX_PKT_SIZE), /* wMaxPacketSize   */
    0x01,                         /* bInterval        */

    /* INTERFACE descriptor */
    LEN_INTERFACE,      /* bLength              */
    DESC_INTERFACE,     /* bDescriptorType      */
    INTF_NUM_VCOM3 + 1, /* bInterfaceNumber     */
    0x00,               /* bAlternateSetting    */
    0x02,               /* bNumEndpoints        */
    0x0A,               /* bInterfaceClass      */
    0x00,               /* bInterfaceSubClass   */
    0x00,               /* bInterfaceProtocol   */
    0x00,               /* iInterface           */

    /* ENDPOINT descriptor */
    LEN_ENDPOINT,                  /* bLength          */
    DESC_ENDPOINT,                 /* bDescriptorType  */
    (EP_INPUT | BULK_IN_EP_NUM_3), /* bEndpointAddress */
    EP_BULK,                       /* bmAttributes     */
    GET_BYTE0(EP12_MAX_PKT_SIZE),
    GET_BYTE1(EP12_MAX_PKT_SIZE), /* wMaxPacketSize   */
    0x00,                         /* bInterval        */

    /* ENDPOINT descriptor */
    LEN_ENDPOINT,                    /* bLength          */
    DESC_ENDPOINT,                   /* bDescriptorType  */
    (EP_OUTPUT | BULK_OUT_EP_NUM_3), /* bEndpointAddress */
    EP_BULK,                         /* bmAttributes     */
    GET_BYTE0(EP13_MAX_PKT_SIZE),
    GET_BYTE1(EP13_MAX_PKT_SIZE), /* wMaxPacketSize   */
    0x00,                         /* bInterval        */
#endif
#if (VCOM_CNT >= 5)
    // IAD
    LEN_IAD,        // bLength: Interface Descriptor size
    DESC_IAD,       // bDescriptorType: IAD
    INTF_NUM_VCOM4, // bFirstInterface
    0x02,           // bInterfaceCount
    0x02,           // bFunctionClass: CDC
    0x02,           // bFunctionSubClass
    0x01,           // bFunctionProtocol
    0x02,           // iFunction

    /* VCOM - 4 */
    /* INTERFACE descriptor */
    LEN_INTERFACE,  /* bLength              */
    DESC_INTERFACE, /* bDescriptorType      */
    INTF_NUM_VCOM4, /* bInterfaceNumber     */
    0x00,           /* bAlternateSetting    */
    0x01,           /* bNumEndpoints        */
    0x02,           /* bInterfaceClass      */
    0x02,           /* bInterfaceSubClass   */
    0x01,           /* bInterfaceProtocol   */
    0x00,           /* iInterface           */

    /* Header Functional descriptor */
    0x05,                  /* Size of the descriptor, in bytes */
    DESC_CDC_CS_INTERFACE, /* CS_INTERFACE descriptor type */
    DESC_CDC_HEADER,       /* Header functional descriptor subtype */
    0x10, 0x01, /* Communication device compliant to the communication spec.
                   ver. 1.10 */

    /* Call Management Functional descriptor */
    0x05,                     /* Size of the descriptor, in bytes */
    DESC_CDC_CS_INTERFACE,    /* CS_INTERFACE descriptor type */
    DESC_CDC_CALL_MANAGEMENT, /* Call management functional descriptor */
    0x00, /* BIT0: Whether device handle call management itself. */
    /* BIT1: Whether device can send/receive call management information over a
       Data Class Interface 0 */
    INTF_NUM_VCOM4 + 1, /* Interface number of data class interface optionally
             used for call management */

    /* Abstract Control Management Functional Descriptor  */
    0x04,                                 /* Size of the descriptor, in bytes */
    DESC_CDC_CS_INTERFACE,                /* CS_INTERFACE descriptor type */
    DESC_CDC_ABSTRACT_CONTROL_MANAGEMENT, /* Abstract control management
                                             functional descriptor subtype */
    0x00,                                 /* bmCapabilities       */

    /* Union Functional descriptor */
    0x05,                  /* bLength              */
    DESC_CDC_CS_INTERFACE, /* bDescriptorType: CS_INTERFACE descriptor type */
    DESC_CDC_UNION,        /* bDescriptorSubType   */
    INTF_NUM_VCOM4,        /* bMasterInterface     */
    INTF_NUM_VCOM4 + 1,    /* bSlaveInterface0     */

    /* ENDPOINT descriptor */
    LEN_ENDPOINT,                 /* bLength          */
    DESC_ENDPOINT,                /* bDescriptorType  */
    (EP_INPUT | INT_IN_EP_NUM_4), /* bEndpointAddress */
    EP_INT,                       /* bmAttributes     */
    GET_BYTE0(EP14_MAX_PKT_SIZE),
    GET_BYTE1(EP14_MAX_PKT_SIZE), /* wMaxPacketSize   */
    0x01,                         /* bInterval        */

    /* INTERFACE descriptor */
    LEN_INTERFACE,      /* bLength              */
    DESC_INTERFACE,     /* bDescriptorType      */
    INTF_NUM_VCOM4 + 1, /* bInterfaceNumber     */
    0x00,               /* bAlternateSetting    */
    0x02,               /* bNumEndpoints        */
    0x0A,               /* bInterfaceClass      */
    0x00,               /* bInterfaceSubClass   */
    0x00,               /* bInterfaceProtocol   */
    0x00,               /* iInterface           */

    /* ENDPOINT descriptor */
    LEN_ENDPOINT,                  /* bLength          */
    DESC_ENDPOINT,                 /* bDescriptorType  */
    (EP_INPUT | BULK_IN_EP_NUM_4), /* bEndpointAddress */
    EP_BULK,                       /* bmAttributes     */
    GET_BYTE0(EP15_MAX_PKT_SIZE),
    GET_BYTE1(EP15_MAX_PKT_SIZE), /* wMaxPacketSize   */
    0x00,                         /* bInterval        */

    /* ENDPOINT descriptor */
    LEN_ENDPOINT,                    /* bLength          */
    DESC_ENDPOINT,                   /* bDescriptorType  */
    (EP_OUTPUT | BULK_OUT_EP_NUM_4), /* bEndpointAddress */
    EP_BULK,                         /* bmAttributes     */
    GET_BYTE0(EP16_MAX_PKT_SIZE),
    GET_BYTE1(EP16_MAX_PKT_SIZE), /* wMaxPacketSize   */
    0x00,                         /* bInterval        */
#endif
};

