OpenNuvoton/M253BSP/SampleCode/StdDriver/USBD_VCOM_MultiPort/descriptors.c
/*!<USB BOS Descriptor */
const uint8_t gu8BosDescriptor[] =
    {
        LEN_BOS,                         /* bLength         */
        DESC_BOS,                        /* bDescriptorType */
        ((LEN_BOS + LEN_DEVCAP) & 0xFF), /* wTotalLength    */
        ((LEN_BOS + LEN_DEVCAP) >> 8),   /* wTotalLength    */
        0x01,                            /* bNumDevcieCaps  */
        LEN_DEVCAP,                      /* bLength         */
        DESC_CAPABILITY,                 /* bDescriptorType */
        CAP_USB20_EXT,                   /* bDevCapabilityType, 0x02 is USB 2.0 Extension */
        0x06, 0x04, 0x00, 0x00           /* bmAttributs, 32 bits                          */
        /* bit 0     : Reserved. Must be 0.                                         */
        /* bit 1     : Set 1 to support LPM.                                        */
        /* bit 2     : Set 1 to support BSL & Alternative HIRD.                     */
        /* bit 3     : Set 1 to use Baseline BESL.                                  */
        /* bit 4     : Set 1 to use Deep BESL.                                      */
        /* bit 11:8  : Baseline BESL value. Ignore it if bit3 is zero.              */
        /* bit 15:12 : Deep BESL value. Ignore it if bit4 is zero.                  */
        /* bit 31:16 : Reserved. Must be 0.                                         */
};

/*!<USB Language String Descriptor */
const uint8_t gu8StringLang[4] =
    {
        4,           /* bLength */
        DESC_STRING, /* bDescriptorType */
        0x09, 0x04};

/*!<USB Vendor String Descriptor */
const uint8_t gu8VendorStringDesc[] = {
    16,
    DESC_STRING,
    'N', 0, 'u', 0, 'v', 0, 'o', 0, 't', 0, 'o', 0, 'n', 0
};

/*!<USB Product String Descriptor */
const uint8_t gu8ProductStringDesc[] = {
    32,          /* bLength          */
    DESC_STRING, /* bDescriptorType  */
    'U', 0, 'S', 0, 'B', 0, ' ', 0, 'V', 0, 'i', 0, 'r', 0, 't', 0, 'u', 0, 'a', 0, 'l', 0, ' ', 0, 'C', 0, 'O', 0, 'M', 0
};

const uint8_t gu8StringSerial[26] = {
    26,          // bLength
    DESC_STRING, // bDescriptorType
    'A', 0, '0', 0, '2', 0, '0', 0, '1', 0, '5', 0, '0', 0, '8', 0, '1', 0, '3', 0, '0', 0, '1', 0
};

const uint8_t *gpu8UsbString[4] = {
    gu8StringLang,
    gu8VendorStringDesc,
    gu8ProductStringDesc,
    gu8StringSerial
};

const S_USBD_INFO_T gsInfo = {
    (uint8_t *)gu8DeviceDescriptor,
    (uint8_t *)gu8ConfigDescriptor,
    (uint8_t **)gpu8UsbString,
    (uint8_t **)NULL,
#ifdef SUPPORT_LPM
    (uint8_t *)gu8BosDescriptor,
#else
    0,
#endif
    (uint32_t *)NULL,
    (uint32_t *)NULL,
};
